In [14]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy import create_engine, MetaData
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Numeric, Text, Float
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
import pandas as pd

In [15]:
top_100 = pd.read_csv("dataset/top_100_movies.csv")
market_share = pd.read_csv("dataset/market_share.csv")

In [16]:
top_100.head()

,Unnamed: 0,Rank,Title,Studio,Total Gross,Theaters,Opening,Opening Theaters,Year,link
0,0,1,Home Alone,Fox,"$285,761,243","2,173","$17,081,997","1,202",1990,/movies/?id=homealone.htm
1,0,2,Ghost,Par.,"$217,631,306","1,766","$12,191,540","1,101",1990,/movies/?id=ghost.htm
2,0,3,Dances with Wolves,Orion,"$184,208,848","1,636","$598,257",14,1990,/movies/?id=danceswithwolves.htm
3,0,4,Pretty Woman,BV,"$178,406,268","1,811","$11,280,591","1,325",1990,/movies/?id=prettywoman.htm
4,0,5,Teenage Mutant Ninja Turtles,NL,"$135,265,915","2,377","$25,398,367","2,006",1990,/movies/?id=teenagemutantninjaturtles.htm

In [17]:
# Remove unwanted columns
studio_100 = top_100.drop(['Rank', 'Title', 'Unnamed: 0', 'Theaters', 'Opening', 'Opening Theaters', 'link'], axis=1)

In [18]:
df = studio_100.groupby(["Year", "Studio"]).count()

In [19]:
# Remove commas and dollars signs
studio_100["Studio"] = studio_100["Studio"].replace("Col.", "Sony")
studio_100["Studio"] = studio_100["Studio"].replace("WB (NL)", "WB")
studio_100["Studio"] = studio_100["Studio"].replace("FoxA", "Fox")
studio_100["Studio"] = studio_100["Studio"].replace("FoxS", "Fox")
studio_100["Total Gross"] = studio_100["Total Gross"].str.replace(",", "")
studio_100["Total Gross"] = studio_100["Total Gross"].str.replace("$", "")
studio_100["Total Gross"] = studio_100["Total Gross"].astype(int)
studio_100.columns = ["Studio", "Studio_Gross", "Year"]

In [20]:
# Get total gross for each studio per year
grouped_100 = studio_100.groupby(["Year", "Studio"]).sum()
grouped_100.head()

             Studio_Gross
Year Studio
1990 BV         683431384
     Fox        668375058
     Gold.       14560247
     MGM         61264584
     Mira.       25437170

In [21]:
df.reset_index(inplace=True)

In [22]:
df.columns

Index(['Year', 'Studio', 'Total Gross'], dtype='object')

In [23]:
# Save the sql file
import sqlite3
conn = sqlite3.connect("dataset/market_share.sqlite")
grouped_100.to_sql("Studio", con=conn, index=True, if_exists="replace")

In [24]:
# Get total gross for the entire year
yearly_gross = grouped_100.groupby(['Year']).sum()
yearly_gross.columns = ["Total_Yearly_Gross"]
yearly_gross.head()

      Total_Yearly_Gross
Year
1990          4201762579
1991          4013340886
1992          4338501242
1993          4493750447
1994          4609740780

In [25]:
# Save the sql file
yearly_gross.to_sql("market_share", con=conn, index=True)

In [26]:
# Save as CSV file
yearly_gross.to_csv("dataset/yearly_gross.csv")
grouped_100.to_csv('dataset/studio.csv')